mutual_ide.org
:PROPERTIES:
:header-args: :comments link
:END:
#+title: Mutualism Project Code

* Simulation

Here we simulate the outcome of many generations of growth-dispersal cycles for three mutualist species. The =simMutualism()= function can take a number of optional arguments.

#+begin_src matlab :tangle simMutualism.m
function simMutualism(varargin)

% we save the given parameters to a variable so we can use them to
% name files and label plots
parameters = varargin;
#+end_src

** Parameters

*** Simulation parameters

The number of growth-dispersal cycles (i.e. iterations) will change based on whether a steady state is reached for all three species. A species reaches a steady state when the variance between the last 10 spread speed values is at or below some threshold.

So the number of iterations defined here is just the /minimum/ number of iterations that a simulation will run. We also set the maximum number of iterations, so even if a steady state isn't reached, the simulation will end after this many cycles. This value is also used to allocate space in a number of arrays used in the simulation. It's faster (although more costly in memory) to preallocate the maximum number of rows we may need to use, rather than to try and increase the size of several large arrays.

We also define the number of additional iterations (=iterationStep=) to add to the simulation before checking for steady states again.

#+begin_comment
Right now, all the optional parameters given to =simMutualism= are passed along to the =growthODEs= function. I'm not sure this matters, but it's possible that you could pass just =p.Unmatched= to =growthODEs= to make the code a little safer and more efficient.

It would be difficult though, since p.Unmatched
#+end_comment

#+begin_src matlab :tangle simMutualism.m
%% for simulation

p = inputParser;
p.KeepUnmatched = true;

% minimum number of cycles of growth and dispersal
addParameter(p, 'iterations', 100, @isnumeric);
addParameter(p, 'maxIterations', 480, @isnumeric);
addParameter(p, 'iterationStep', 100, @isnumeric);
addParameter(p, 'outputDir', './', @isfolder);
addParameter(p, 'steadyStateThreshold', 1e-04, @isnumeric);
addParameter(p, 'diameter', 1200, @isnumeric);

parse(p, varargin{:});

% I wish I knew a better way to get rid of all the p.Results that get attached inputParser parameters
iterations = p.Results.iterations;
maxIterations = p.Results.maxIterations;

if iterations > maxIterations
    disp("Warning: the value of iterations is greater than or equal to maxIterations, so maxIterations has been increased.");
    maxIterations = iterations;
end

iterationStep = p.Results.iterationStep;
outputDir = p.Results.outputDir;
steadyStateThreshold = p.Results.steadyStateThreshold;

%total size of landscape along positive x-axis (so half the total landscape)
diameter = p.Results.diameter;

if maxIterations > 490
    diameter = 3600;
    disp("Warning: maxIterations > 490 risks exceeding the spatial landscape boundaries. The diameter of the landscape has been increased to 3600. The spatial resolution has NOT been increased.");
end
#+end_src

*** Space parameters

Here we create the one-dimensional landscape in which the species will disperse.

=linspace(x1, x2, n)= creates a vector of =n= points between points =x1= and =x2=. Spacing between points is =(x2-x1)/(n-1)=. See [[https://in.mathworks.com/help/matlab/ref/linspace.html][linspace documentation]].

#+begin_comment
Why these specific values?

#+end_comment

#+begin_src matlab :tangle simMutualism.m
%% Initialize space parameters
lowval = 1e-9;
nodes = (2^16) + 1; %total points in space -- 65537
radius = diameter / 2;
x = linspace(-radius, radius, nodes);
x2 = linspace(-diameter, diameter, 2 * nodes - 1);
dx = diameter / (nodes - 1);
#+end_src

** Initialization

Here we initialize the arrays we'll use throughout the simulation. The speed arrays save the instantaneous or average spread speed of a species for each iteration. The range edge arrays keep track of the furthest spatial location on one side of a species' range. The /n/ population arrays keep track of each species' population density across the entire spatial range.

#+begin_src matlab :tangle simMutualism.m
[instantSpeedP, avgSpeedP, instantSpeedF1, avgSpeedF1, instantSpeedF2, avgSpeedF2] = deal(zeros(1, maxIterations + 1)); % preallocate arrays for max possible iterations + 1

[rangeEdgeP,rangeEdgeF1, rangeEdgeF2] = deal(zeros(1, maxIterations + 1));

[nP, nF1, nF2] = deal(zeros(maxIterations + 1, length(x)));
#+end_src

*** Dispersal kernels

We use a Gaussian dispersal kernel for each species. At some point we'll rewrite this to allow for other dispersal kernel functions.

#+begin_src matlab :tangle simMutualism.m
sigma_sq = 0.25; % Dispersal variance

% gaussian dispersal kernels
kP = exp(-(x2.^2)/(2*sigma_sq))./sqrt(2*pi*sigma_sq);
kF1 = exp(-(x2.^2)/(2*sigma_sq))./sqrt(2*pi*sigma_sq);
kF2 = exp(-(x2.^2)/(2*sigma_sq))./sqrt(2*pi*sigma_sq);
#+end_src

*** Initial population densities

We set the initial population densities across the spatial range.

#+begin_src matlab :tangle simMutualism.m
% SET THE INITIAL CONDITIONS
irad = 2; % Initial condition range
initDensities = [0.1,0.1,0.1];
nThreshold = 0.05; % critical threshold for edge of wave
temp_P = find(abs(x) <= irad); %locate all values in the array x that lie b/w +irad and -irad units of space
temp_F1 = find(abs(x) <= irad);
temp_F2 = find(abs(x) <= irad);

nP(1,temp_P) = initDensities(1) * normpdf(x(temp_P),0,1); %Computes pdf values evaluated at the values in x i.e. all x(temp) values for the normal distribution with mean 0 and standard deviation 1.
nF1(1,temp_F1) = initDensities(2) * normpdf(x(temp_F1),0,1);
nF2(1,temp_F2) = initDensities(3) * normpdf(x(temp_F2),0,1);
#+end_src

*** Initial front location

#+begin_src matlab :tangle simMutualism.m
% FIND THE INITIAL FRONT LOCATION
jj_P = find(nP(1,:) >= nThreshold,1,'last'); %find the farthest distance travelled by the population above a certain threshold density and assign it to jj
jj_F1 = find(nF1(1,:) >= nThreshold,1,'last');
jj_F2 = find(nF2(1,:) >= nThreshold,1,'last');

if jj_P %the initial front is obtained from initialization which will be in the first row of 'n'
  rangeEdgeP(1) = interp1(nP(1,jj_P:jj_P+1),x(jj_P:jj_P+1),nThreshold);
end
if jj_F1
  rangeEdgeF1(1) = interp1(nF1(1,jj_F1:jj_F1+1),x(jj_F1:jj_F1+1),nThreshold);
end

if jj_F2
  rangeEdgeF2(1) = interp1(nF2(1,jj_F2:jj_F2+1),x(jj_F2:jj_F2+1),nThreshold);
end
#+end_src

** Simulating growth and dispersal over many generations

#+begin_src matlab :tangle simMutualism.m
generation = 1;
%% Looping for growth and dispersal
while generation <= iterations
#+end_src

*** Growth phase

#+begin_src matlab :tangle simMutualism.m
    % for ode45
    tspan = [0, 10];

    %Growth
    y0 = [nP(generation,:);nF1(generation,:);nF2(generation,:)];

    % reshape happens such that 3 consecutive rows for nP, nF1, and nF2 values are stacked
    y0 = reshape(y0, 3*length(y0), 1);

    [t,y] = ode45(@(t,y) growthODEs(t,y, varargin{:}), tspan, y0); %remember to alter where the dep_p and dep_f are being called from


    % We just want the results of the growth phase (end)
    fP = y(end,(1:3:end)); % final row; element 1, +3, elem. 4, etc. until end
    fF1 = y(end,(2:3:end));
    fF2 = y(end,(3:3:end));
#+end_src

*** Dispersal phase

#+begin_src matlab :tangle simMutualism.m
%   DISPERSAL
    n1P = fft_conv(kP,fP);   % dispersing individuals
    n1F1 = fft_conv(kF1,fF1);
    n1F2 = fft_conv(kF2,fF2);

    nP(generation + 1,:) = dx*n1P(nodes:length(x2)); %the convolution apparently doubles the length of the array?
    nF1(generation + 1,:) = dx*n1F1(nodes:length(x2));
    nF2(generation + 1,:) = dx*n1F2(nodes:length(x2));

    nP(generation + 1,1) = nP(generation + 1,1)/2; nP(generation + 1,nodes) = nP(generation + 1,nodes)/2; %The population density at the edges is halved

    nF1(generation + 1,1) = nF1(generation + 1,1)/2; nF1(generation + 1,nodes) = nF1(generation + 1,nodes)/2;

    nF2(generation + 1,1) = nF2(generation + 1,1)/2; nF2(generation + 1,nodes) = nF2(generation + 1,nodes)/2;

    temp_P = find(nP(generation + 1,:) < lowval); %gives location of random places where numbers are above zero due to some numerical errors
    temp_F1 = find(nF1(generation + 1,:) < lowval);
    temp_F2 = find(nF2(generation + 1,:) < lowval);

    nP(generation + 1,temp_P) = zeros(size(nP(generation + 1,temp_P))); %set the places with those numerical errors to zero
    nF1(generation + 1,temp_F1) = zeros(size(nF1(generation + 1,temp_F1)));%delete this for STE
    nF2(generation + 1,temp_F2) = zeros(size(nF2(generation + 1,temp_F2)));%delete this for STE

    jj_P = find(nP(generation + 1,:) >= nThreshold,1,'last');
    jj_F1 = find(nF1(generation + 1,:) >= nThreshold,1,'last');
    jj_F2 = find(nF2(generation + 1,:) >= nThreshold,1,'last');

    % if any of the species' range edge is equal to the edge of the entire
    % spatial range, stop the growth-dispersal loop. We set total iterations to
    % the last iteration + 1 so the data is still usable.
    if (jj_P == nodes) | (jj_F1 == nodes) | (jj_F2 == nodes)
        iterations = generation;
        disp("Warning: the simulation was stopped because one or more species have reached the edge of the landscape.");
        break;
    end

    if jj_P
         rangeEdgeP(generation + 1) = interp1(nP(generation + 1,jj_P:jj_P + 1),x(jj_P:jj_P + 1),nThreshold);
    end

    if jj_F1
         rangeEdgeF1(generation + 1) = interp1(nF1(generation + 1,jj_F1:jj_F1 + 1),x(jj_F1:jj_F1 + 1),nThreshold);
    end

    if jj_F2
         rangeEdgeF2(generation + 1) = interp1(nF2(generation + 1,jj_F2:jj_F2 + 1),x(jj_F2:jj_F2 + 1),nThreshold);
    end

    avgSpeedP(generation) = (rangeEdgeP(generation + 1) - rangeEdgeP(1)) / generation; %latest position of wave edge - initial position of wave edge divided by time
    instantSpeedP(generation) = rangeEdgeP(generation + 1) - rangeEdgeP(generation);

    instantSpeedF1(generation) = rangeEdgeF1(generation + 1) - rangeEdgeF1(generation);
    avgSpeedF1(generation) = (rangeEdgeF1(generation + 1) - rangeEdgeF1(1)) / generation; %latest position of wave edge - initial position of wave edge divided by time

    instantSpeedF2(generation) = rangeEdgeF2(generation + 1) - rangeEdgeF2(generation);
    avgSpeedF2(generation) = (rangeEdgeF2(generation + 1) - rangeEdgeF2(1)) / generation; %latest position of wave edge - initial position of wave edge divided by time
#+end_src

*** Determine whether to continue running the simulation for more iterations

#+begin_src matlab :tangle simMutualism.m
    % check for steady state, and determine whether to run for more generations
    if (generation == iterations)

        % if not all species at steady state
        if ~(isSpeciesSteadyState(instantSpeedP, steadyStateThreshold, generation) && isSpeciesSteadyState(instantSpeedF1, steadyStateThreshold, generation) && isSpeciesSteadyState(instantSpeedF2, steadyStateThreshold, generation))

            % iterations close to the max
            if iterations >= (maxIterations - iterationStep)
                iterations = maxIterations;
            else
                iterations = iterations + iterationStep;
            end
        end
    end

    generation = generation + 1;

% while loop end
end
#+end_src

*** Checking if a species is at a steady state

This function takes the spread speed values for a given species and checks to see if the variance in the last 10 values is at or below a threshold to determine whether a steady state has been reached.

#+begin_src matlab :tangle isSpeciesSteadyState.m
function isSteadyState = isSpeciesSteadyState(speed, tolerance, generation)
% takes a matrix of speed values and checks whether the variance in the last 10 values is at or below a threshold

    variance = sqrt(var(speed((generation - 9):generation)));

    if variance <= tolerance
        isSteadyState = true;
    else
        isSteadyState = false;
    end
end
#+end_src

*** Generate and save a mat file for the simulation

Using =maxIterations= to create the initial arrays means that these arrays may be storing many more rows than is actually necessary. Since we're saving these to mat files, we can reduce the size before saving by resizing the arrays. By getting rid of extra rows, we can also use the =end= index to get the population densities of the final iteration.

Then we can save our results to a mat file, which can then be used to generate figures, identify outcomes, etc. The =filename= string can be reused for saving figures as well. It takes any explicitly defined parameters from the call to =simMutualism()= and appends the names and values to =filename=.

#+begin_src matlab :tangle simMutualism.m
%% Save a mat file with the current parameter values

nP = nP(1:(iterations + 1), :);
nF1 = nF1(1:(iterations + 1), :);
nF2 = nF2(1:(iterations + 1), :);

instantSpeedP = instantSpeedP(1, 1:(iterations + 1));
instantSpeedF1 = instantSpeedF1(1, 1:(iterations + 1));
instantSpeedF2 = instantSpeedF2(1, 1:(iterations + 1));

%% Save a mat file with the current parameter values

filename = 'results';
formatSpec = '%.2f';

if ~(isempty(parameters))
    for i = 1:length(parameters)
        param = parameters{i};

        if isnumeric(param)
            param = num2str(param, formatSpec);
        elseif strcmp(param, 'outputDir') || isfolder(param)
            continue
        else
            param = string(param);
        end

        filename = strcat(filename, '_', param);
    end
end

filename = strcat(filename, '.mat');

save(strcat(outputDir, filename), 'nP', 'nF1', 'nF2', 'iterations', 'nThreshold', 'instantSpeedP', 'instantSpeedF1', 'instantSpeedF2', 'filename', 'parameters', 'x', 'maxIterations', 'diameter');

% end of simMutualism function
end
#+end_src

* Growth Model

Here we define the growth of each species using a system of ODEs.

** System of Equations (=growthODEs.m=)

*** Function definition

With =varargin=, we can optionally use parameter values other than the defaults, e.g. =growthODEs(t, y, 'rP', 0.4)=. We need to use an [[https://www.mathworks.com/help/matlab/ref/inputparser.html][inputParser]] to manage the function's parameters.

#+begin_src matlab :tangle growthODEs.m

% function dydt = growthODEs(t, y, r1, r2, alpha12, alpha21, q1, q2, beta1, beta2, c1, c2, d1, d2, h1, h2,e1, e2, nodes, dep_p, dep_f, comp_12, comp_21)
function dydt = growthODEs(t, y, varargin)

#+end_src

*** Default parameter values

We set our default parameter values here. If the parameter is not explicitly defined in the function call, then these default values are used.

#+begin_src matlab :tangle growthODEs.m

    %% Default ODE parameter values

    default_nodes = (2^16) + 1;

    % intrinsic growth
    default_rP = 0.3;
    default_rF1 = 0.3;
    default_rF2 = 0.3;

    % mutualism benefits
    default_alphaPF1 = 0.5;
    default_alphaPF2 = 0.5;
    default_alphaF1P = 0.5;
    default_alphaF2P = 0.5;

    default_qP = 1.0;
    default_qF1 = 1.0;
    default_qF2 = 1.0;

    % mutualism costs
    default_betaP = 0.0;
    default_betaF1 = 0.0;
    default_betaF2 = 0.0;

    default_cP = 1.0;
    default_cF1 = 1.0;
    default_cF2 = 1.0;

    % death rate
    default_dP = 0.1;
    default_dF1 = 0.1;
    default_dF2 = 0.1;

    % saturation
    default_hPF1 = 0.3;
    default_hPF2 = 0.3;
    default_hF1P = 0.3;
    default_hF2P = 0.3;

    default_eP = 0.3;
    default_eF1 = 0.3;
    default_eF2 = 0.3;

    % = 0.0;
    default_deltaP = 0.0;
    default_deltaF1 = 0.9;
    default_deltaF2 = 0.1;

    % competition: tau12 is the effect F2 has on F1; tau21 is effect of F1 on F2
    default_tau12 = 0.0;
    default_tau21 = 0.0;

#+end_src

