mutual_ide.org
*** Adding parameters with =inputParser=

See [[https://www.mathworks.com/help/matlab/ref/inputparser.html][inputParser]] and [[https://www.mathworks.com/help/matlab/ref/inputparser.addparameter.html][addParameter]] documentation. By setting =p.KeepUnmatched = true=, we can pass along all the parameters given in the simMutualism function call and just ignore the ones that are not relevant to the ODE parameters.

#+begin_src matlab :tangle growthODEs.m

    p = inputParser;
    p.KeepUnmatched = true;

    addRequired(p, 't');
    addRequired(p, 'y');

    %% Optional ODE parameters

    addParameter(p, 'nodes', default_nodes);

    % intrinsic growth rates
    addParameter(p, 'rP', default_rP);
    addParameter(p, 'rF1', default_rF1);
    addParameter(p, 'rF2', default_rF2);

    % mutualism benefits
    addParameter(p, 'alphaPF1', default_alphaPF1);
    addParameter(p, 'alphaPF2', default_alphaPF2);
    addParameter(p, 'alphaF1P', default_alphaF1P);
    addParameter(p, 'alphaF2P', default_alphaF2P);

    addParameter(p, 'qP', default_qP );
    addParameter(p, 'qF1', default_qF1);
    addParameter(p, 'qF2', default_qF2);

    % mutualism costs
    addParameter(p, 'betaP', default_betaP);
    addParameter(p, 'betaF1', default_betaF1);
    addParameter(p, 'betaF2', default_betaF2);

    addParameter(p, 'cP', default_cP);
    addParameter(p, 'cF1', default_cF1);
    addParameter(p, 'cF2', default_cF2);

    % death rate
    addParameter(p, 'dP', default_dP);
    addParameter(p, 'dF1', default_dF1);
    addParameter(p, 'dF2', default_dF2);

    % saturation
    addParameter(p, 'hPF1', default_hPF1);
    addParameter(p, 'hPF2', default_hPF2);
    addParameter(p, 'hF1P', default_hF1P);
    addParameter(p, 'hF2P', default_hF2P);

    addParameter(p, 'eP', default_eP);
    addParameter(p, 'eF1', default_eF1);
    addParameter(p, 'eF2', default_eF2);

    % mutualism dependence
    addParameter(p, 'deltaP', default_deltaP);
    addParameter(p, 'deltaF1', default_deltaF1);
    addParameter(p, 'deltaF2', default_deltaF2);

    % competition
    addParameter(p, 'tau12', default_tau12);
    addParameter(p, 'tau21', default_tau21);

    parse(p, t, y, varargin{:});

    % relabel variables so they're easier to read in the equation

    t = p.Results.t;
    y = p.Results.y;
    nodes = p.Results.nodes;

    % intrinsic growth
    rP = p.Results.rP;
    rF1 = p.Results.rF1;
    rF2 = p.Results.rF2;

    % mutualism benefits
    alphaPF1 = p.Results.alphaPF1;
    alphaPF2 = p.Results.alphaPF2;
    alphaF1P = p.Results.alphaF1P;
    alphaF2P = p.Results.alphaF2P;

    qP = p.Results.qP;
    qF1 = p.Results.qF1;
    qF2 = p.Results.qF2;

    % mutualism costs
    betaP = p.Results.betaP;
    betaF1 = p.Results.betaF1;
    betaF2 = p.Results.betaF2;

    cP = p.Results.cP;
    cF1 = p.Results.cF1;
    cF2 = p.Results.cF2;

    % death rate
    dP = p.Results.dP;
    dF1 = p.Results.dF1;
    dF2 = p.Results.dF2;

    % saturation
    hPF1 = p.Results.hPF1;
    hPF2 = p.Results.hPF2;
    hF1P = p.Results.hF1P;
    hF2P = p.Results.hF2P;

    eP = p.Results.eP;
    eF1 = p.Results.eF1;
    eF2 = p.Results.eF2;

    % mutualism dependence
    deltaP = p.Results.deltaP;
    deltaF1 = p.Results.deltaF1;
    deltaF2 = p.Results.deltaF2;

    % competition: tau12 is the effect F2 has on F1; tau21 is effect of F1 on F2
    tau12 = p.Results.tau12;
    tau21 = p.Results.tau21;

    y = reshape(y,3,nodes);
    dydt  = zeros(size(y));


#+end_src

*** Species /P/


\begin{align*}
\frac{dP}{dt} = P\left[ (1 - \deltaP) r_P &+ \deltaP \left( c_1 \left[\frac{\alpha_{PF_1} F_1}{h_P_1 + F_1}  + \frac{\alpha_{PF_2} F_2}{h_P_2 + F_2} \right] \right) \\
&- \delta_{F1} \left( q_1 \left[ \frac{\beta_{P} F_1}{e_P + P} \right] \right) - \delta_{F2} \left( q_1 \left[ \frac{\beta_{P} F_2}{e_P + P} \right] \right) - d_{P} P \right]
\end{align*}

#+begin_src matlab :tangle growthODEs.m

    % rename variables so equations are easier to read
    P = y(1,:);
    F1 = y(2,:);
    F2 = y(3,:);

    dydt(1,:) = P .* ((1 - deltaP) * rP + deltaP * (cP * ((alphaPF1 .* F1) ./ (hPF1 + F1) + (alphaPF2 .* F2) ./ (hPF2 + F2))) - deltaF1 * (qP * (betaP .* F1 ./ (eP + P))) - deltaF2 * (qP * (betaP .* F2 ./ (eP + P))) - (dP .* P));

#+end_src

*** Species /F/, Phenotype 1

$$
\frac{dF_1}{dt} = F_1[(1 - \delta_{F_1})r_{F_1} + \delta_{F_1} \left( c_2 \left[\frac{\alpha_{F_1P}P}{h_{F_1} + P} \right] \right) - \deltaP \left(q_2  \left[ \frac{\beta_{F_1}P}{e_{F_1} + F_1} \right] \right) - \tau_{12}F_2 - d_{F_1}F_1]
$$

#+begin_src matlab :tangle growthODEs.m

    dydt(2,:) = F1 .* ((1 - deltaF1) * rF1 + cF1 * (deltaF1 * (alphaF1P .* P) ./ (hF1P + P)) - qF1 * (deltaP * ((betaF1 .* P) ./ (eF1 + F1))) - (tau12 .* F2) - (dF1 .* F1));
#+end_src

*** Species /F/, Phenotype 2

$$
\frac{dF_2}{dt} = F_2[(1 - \delta_{F_2})r_{F_2} + \delta_{F_2} \left(c_2 \left[\frac{\alpha_{F_2P}P}{h_{F_2} + P} \right] \right) - \deltaP \left(q_2  \left[ \frac{\beta_{F_2}P}{e_{F_2} + F_2} \right] \right) - \tau_{21}F_1 - d_{F_2}F_2]
$$

#+begin_src matlab :tangle growthODEs.m

    dydt(3,:) = F2 .* ((1 - deltaF2) * rF2 + cF2 * (deltaF2 * (alphaF2P .* P) ./ (hF2P + P)) - qF2 * (deltaP * ((betaF2 .* P) ./ (eF2 + F2))) - (tau21 .* F1) - (dF2 .* F2));

#+end_src

*** Reshape

#+begin_src matlab :tangle growthODEs.m

    dydt = reshape(dydt,3*nodes,1);
end

#+end_src

* Parameter sweep

** Sweep script

This is the main file to be edited when running parameter sweeps. The =simMutualism()= function requires an output directory as an argument. It can take any ODE parameter as an optional argument. to override a default value, use the parameter variable name then a value, i.e. =simMutualism(outputDir, 'tau12', 0.3, 'tau21', 0.14)=. These variables will get added to the filename of the exported mat file at the end of the simulation.

We can adjust values of =maxIterations= in the for loop to allow for longer simulations of $\tau$ values that we know will take longer to reach a steady state. By allow for more iterations for only these values, we limit the number of very large mat files.

#+begin_src matlab :tangle tauSweep.m
% use integers for the number of iterations to run (rather than the actual
% values of tau12 and tau21) because it seems parfor requires it

maxIterations = 1000;
rangeStep = 0.01;

outputDir = '/home/shawa/lutzx119/tauSweep/';

% instead of using a for loop for the tau12 values, we can use Slurm to set up
% jobs for each tau12 value. To change the range of tau12 values, modify the
% "SBATCH --array=" line in the Slurm job script.
tau12 = rangeStep * str2num(getenv("SLURM_ARRAY_TASK_ID"));

parfor j = 0:40

    tau21 = j * rangeStep;

    % more iterations for tau values that result in regional coexistence
    if (tau12 > 0.13 && tau12 < 0.25 && tau21 < 0.15) || (tau21 > 0.28 && tau12 > 0.23 && tau12 < 0.3)
        simMutualism('outputDir', outputDir, 'tau12', tau12, 'tau21', tau21, 'maxIterations', maxIterations, 'diameter', 3600);
    else
        simMutualism('outputDir', outputDir, 'tau12', tau12, 'tau21', tau21);
    end

end
#+end_src


** Slurm job script

Note that the $SBATCH lines *must* be at the top of the script. Anything before that will break Slurm.

#+begin_comment
For this reason, I'm not setting up detangling for the jobscript.
#+end_comment


#+begin_src shell :tangle jobscript.sh :comments none
#!/bin/bash -l
#SBATCH --nodes=1
#SBATCH --ntasks=1
#SBATCH --cpus-per-task=4
#SBATCH --mem-per-cpu=4G
#SBATCH --time=2:00:00
#SBATCH --array=0-40
#SBATCH --mail-type=ALL
#SBATCH --mail-user=lutzx119@umn.edu
#SBATCH --output=/home/shawa/lutzx119/reports/tausweep-%j.out

cd /home/shawa/lutzx119/mutualism
module purge

module load matlab
matlab -nodisplay <tauSweep.m

#+end_src

** Function to classify outcome (=classifyOutcome.m=)

This function takes the final population densities of species $F_1$ and $F_2$ and classifies the outcome of the simulation. The possible outcomes are:

- F1 dominance (=outcome = 1=)
- F2 dominance (=outcome = 2=)
- local coexistence (=outcome = 3=)
- local coexistence with F1 dominance (=outcome = 4=)
- local coexistence with F2 dominance (=outcome = 5=)
- regional coexistence (=outcome = 6=)
- unknown (=outcome = 7=).

First we find the values above =nThreshold= across the landscape — this gives us each species final range. We use the =max= function to determine whether $F_1$ or $F_2$ had the bigger range.

In order to make classification easier we create a variable that tells us whether or not $F_1$ had the larger range than $F_2$, based on the result of the =max= function.

#+begin_src matlab :tangle classifyOutcome.m

%% Function to classify outcome of a given simulation
function outcome = classifyOutcome(finalNF1, finalNF2, nThreshold);

    % get the ranges where F1 and F2 populations are above the threshold
    rangeF1 = find(finalNF1 >= nThreshold);
    rangeF2 = find(finalNF2 >= nThreshold);

    maxRange = max(length(rangeF1), length(rangeF2));

    if length(rangeF1) == maxRange
        isF1Dominant = true;
    else
        isF1Dominant = false;
    end

    % maxRange = size(rangeP);
#+end_src

In the simplest cases, there were no population values above =nThreshold= for either $F_1$ or $F_2$; this means the other species competitively excluded it and we can classify the outcome as /$F_1$ or $F_2$ dominance/.

#+begin_src matlab :tangle classifyOutcome.m
    % if F2 is below the threshold across the total range, then classify as
    % F1 dominance
    if isempty(rangeF2)
        outcome = 1; % F1 dominance

    % if F1 is below the threshold across the total range, then classify as
    % F2 dominance
    elseif isempty(rangeF1)
        outcome = 2; % F2 dominance

#+end_src

Next, we look to see if the $F$ species with the larger range was dominant for less than 0.05 of its total range. The =setxor= function gives us the areas of space where the species with the greater range competitively excluded the other. We determine the total length of these areas and then divide by =maxRange= to get the proportion of the total range where this species was dominant. If this proportion is less than the (arbitrary) threshold of 0.05, we classify this as /local coexistence/.

#+begin_src matlab :tangle classifyOutcome.m

    % find the range of values in rangeF1 or rangeF2 but not both
    % if the proportion of this range over the total range is less than
    % the arbitrary value 0.05, we call it local coexistence
    elseif length(setxor(rangeF1, rangeF2))/maxRange < 0.05
        outcome = 3; % Local coexistence
#+end_src

It's possible that the proportion of space where the dominant species competitively excluded the other is greater than 0.05. In this case, we first determine if $F_1$ was the dominant species (i.e. it had the larger range). Since we've already found outcomes where the lengths of the ranges of $F_1$ and $F_2$ differ by less than 5%, we know that any outcomes found here will have at least some local dominance.

Since =setxor(rangeF1, rangeF2)= gives us any area of the landscape where one species competitively excluded the other, we use =intersect= to see if any of those areas fall within =rangeF2=. In other words, if $F_2$ competitively excluded $F_1$ for any proportion of the landscape. If so, we classify this as /regional coexistence/.

If not, this means that $F_1$ has regions of its total range where it has competitively excluded $F_2$ (the proportion of which must be greater than or equal to 0.05). We know from the comparisons above, however, that $F_1$ still occupies some proportion of the landscape, so we classify this as /local coexistence with $F_1$ dominance/.

We then make the same comparisons when $F_2$ has the larger range. Finally, we classify any outcome that does not fall into these categories as "unknown", which most likely indicates some sort of error.

#+begin_src matlab :tangle classifyOutcome.m

    elseif length(rangeF1) > length(rangeF2)

        % we find at least some F2 dominance
        if intersect(rangeF2, setxor(rangeF1, rangeF2))
            outcome = 6; % regional coexistence

        % no F2 dominance
        else
            outcome = 4; % Local coexistence + F1 dominance
        end

    elseif length(rangeF2) > length(rangeF1)

        % we find at least some F1 dominance
        if intersect(rangeF1, setxor(rangeF1, rangeF2))
            outcome = 6; % regional coexistence
        else
            outcome = 5; % Local coexistence + F2 dominance
        end
    else
        outcome = 7; % unknown
    end
end
#+end_src

* Figures

** Generate plots for paper

#+begin_src matlab :tangle generatePlots.m :comments link
sweepDir = '~/tauSweep/';
figDir = '~/figures/';
formatSpec = '%.2f';

% get the heatmap of all the outcomes
plotOutcomes(sweepDir, 'figDir', figDir);

% tau12 and tau21 pairs
taus = [0 0; 0.05 0; 0.05 0.05; 0.05 0.10; 0.15 0.05; 0.20 0.05; 0.20 0.15; 0.25 0.05; 0.23 0.37; 0.26 0.37; 0.35 0.37];

for i = length(taus)
    filename = strcat(sweepDir, "results_tau12_", num2str(taus(i, 1), formatSpec), "_tau21_", num2str(taus(i, 2), formatSpec), ".mat");

    plotPopSpaceTime(filename, 'figDir', figDir);

    plotFinalPopSpace(filename, 'figDir', figDir);

    plotSpeedTime(filename, 'figDir', figDir);
end
#+end_src

